; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct.__uclibc_locale_struct.201 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.200 }
%struct.__collate_t.200 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-90")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-90")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-90")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/tmp/klee-uclibc-90")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/tmp/klee-uclibc-90")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/tmp/klee-uclibc-90")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/tmp/klee-uclibc-90")
!76 = !{!6, !7}
!77 = !{!72, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 55)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !83, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/tmp/klee-uclibc-90")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "n_calls", scope: !93, file: !94, line: 1342, type: !45, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "getcwd", scope: !94, file: !94, line: 1341, type: !95, scopeLine: 1341, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!94 = !DIFile(filename: "klee_src/runtime/POSIX/fd.c", directory: "/tmp")
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !7, !23}
!97 = distinct !DICompileUnit(language: DW_LANG_C89, file: !98, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !99, globals: !159, nameTableKind: None)
!98 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd.c", directory: "/tmp/klee_build90stp_z3/runtime/POSIX")
!99 = !{!100, !6, !101, !10, !105, !7, !120, !45, !8}
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !102, line: 93, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 141, baseType: !100)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !107, line: 37, size: 2240, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!108 = !{!109, !111, !112, !114, !116}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !106, file: !107, line: 39, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !104, line: 137, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !106, file: !107, line: 40, baseType: !103, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !106, file: !107, line: 41, baseType: !113, size: 16, offset: 128)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !106, file: !107, line: 42, baseType: !115, size: 8, offset: 144)
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !106, file: !107, line: 43, baseType: !117, size: 2048, offset: 152)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !122, line: 46, size: 1152, elements: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!123 = !{!124, !126, !128, !130, !133, !135, !137, !138, !139, !141, !143, !145, !153, !154, !155}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !121, file: !122, line: 48, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !104, line: 133, baseType: !10)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !121, file: !122, line: 53, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !104, line: 136, baseType: !10)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !121, file: !122, line: 61, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !104, line: 139, baseType: !10)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !121, file: !122, line: 62, baseType: !131, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !104, line: 138, baseType: !132)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !121, file: !122, line: 64, baseType: !134, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !104, line: 134, baseType: !132)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !121, file: !122, line: 65, baseType: !136, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !104, line: 135, baseType: !132)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !121, file: !122, line: 67, baseType: !45, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !121, file: !122, line: 69, baseType: !125, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !121, file: !122, line: 74, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 140, baseType: !100)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !121, file: !122, line: 78, baseType: !142, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !104, line: 162, baseType: !100)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !121, file: !122, line: 80, baseType: !144, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !104, line: 167, baseType: !100)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !121, file: !122, line: 91, baseType: !146, size: 128, offset: 576)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !147, line: 9, size: 128, elements: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !146, file: !147, line: 11, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 148, baseType: !100)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !146, file: !147, line: 12, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !104, line: 184, baseType: !100)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !121, file: !122, line: 92, baseType: !146, size: 128, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !121, file: !122, line: 93, baseType: !146, size: 128, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !121, file: !122, line: 106, baseType: !156, size: 192, offset: 960)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 192, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 3)
!159 = !{!160, !165, !172, !179, !185, !190, !91}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !94, line: 313, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "close", scope: !94, file: !94, line: 312, type: !163, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !94, line: 345, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "read", scope: !94, file: !94, line: 344, type: !168, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !45, !6, !23}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !102, line: 109, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !104, line: 181, baseType: !100)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !94, line: 411, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "write", scope: !94, file: !94, line: 410, type: !175, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!170, !45, !177, !23}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "n_calls", scope: !181, file: !94, line: 642, type: !45, isLocal: true, isDefinition: true)
!181 = distinct !DISubprogram(name: "chmod", scope: !94, file: !94, line: 641, type: !182, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!182 = !DISubroutineType(types: !183)
!183 = !{!45, !29, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !102, line: 70, baseType: !131)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "n_calls", scope: !187, file: !94, line: 661, type: !45, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "fchmod", scope: !94, file: !94, line: 660, type: !188, scopeLine: 660, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!45, !45, !184}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "n_calls", scope: !192, file: !94, line: 747, type: !45, isLocal: true, isDefinition: true)
!192 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !94, file: !94, line: 746, type: !193, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!193 = !DISubroutineType(types: !194)
!194 = !{!45, !45, !101}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !197, file: !210, line: 375, type: !450, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !199, globals: !252, nameTableKind: None)
!198 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-90")
!199 = !{!45, !200, !7, !201, !203, !206, !115, !207, !208, !221, !229, !10}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !113)
!206 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !210, line: 400, baseType: !211)
!210 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-90")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 390, size: 128, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !211, file: !210, line: 391, baseType: !205, size: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !211, file: !210, line: 392, baseType: !205, size: 16, offset: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !211, file: !210, line: 393, baseType: !205, size: 16, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !211, file: !210, line: 394, baseType: !205, size: 16, offset: 48)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !211, file: !210, line: 396, baseType: !205, size: 16, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !211, file: !210, line: 397, baseType: !205, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !211, file: !210, line: 398, baseType: !205, size: 16, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !211, file: !210, line: 399, baseType: !205, size: 16, offset: 112)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !210, line: 430, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 425, size: 64, elements: !224)
!224 = !{!225, !226, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !223, file: !210, line: 426, baseType: !205, size: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !223, file: !210, line: 427, baseType: !205, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !223, file: !210, line: 428, baseType: !205, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !223, file: !210, line: 429, baseType: !205, size: 16, offset: 48)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !210, line: 423, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 402, size: 304, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !231, file: !210, line: 403, baseType: !205, size: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !231, file: !210, line: 404, baseType: !205, size: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !231, file: !210, line: 405, baseType: !205, size: 16, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !231, file: !210, line: 406, baseType: !205, size: 16, offset: 48)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !231, file: !210, line: 407, baseType: !205, size: 16, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !231, file: !210, line: 408, baseType: !205, size: 16, offset: 80)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !231, file: !210, line: 409, baseType: !205, size: 16, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !231, file: !210, line: 410, baseType: !205, size: 16, offset: 112)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !231, file: !210, line: 411, baseType: !205, size: 16, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !231, file: !210, line: 412, baseType: !205, size: 16, offset: 144)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !231, file: !210, line: 413, baseType: !205, size: 16, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !231, file: !210, line: 414, baseType: !205, size: 16, offset: 176)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !231, file: !210, line: 415, baseType: !205, size: 16, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !231, file: !210, line: 416, baseType: !205, size: 16, offset: 208)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !231, file: !210, line: 418, baseType: !205, size: 16, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !231, file: !210, line: 419, baseType: !205, size: 16, offset: 240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !231, file: !210, line: 420, baseType: !205, size: 16, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !231, file: !210, line: 421, baseType: !205, size: 16, offset: 272)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !231, file: !210, line: 422, baseType: !205, size: 16, offset: 288)
!252 = !{!253, !438, !195, !440, !443, !445}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "__global_locale", scope: !197, file: !210, line: 377, type: !255, isLocal: false, isDefinition: true)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !256, line: 330, baseType: !257)
!256 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-90")
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !256, line: 154, size: 26560, elements: !259)
!259 = !{!260, !267, !273, !274, !278, !280, !281, !285, !289, !291, !292, !293, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !312, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !258, file: !256, line: 156, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !264, line: 38, baseType: !265)
!264 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-90")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !266, line: 44, baseType: !113)
!266 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-90")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !258, file: !256, line: 157, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !264, line: 42, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !266, line: 43, baseType: !272)
!272 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !258, file: !256, line: 158, baseType: !268, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !258, file: !256, line: 162, baseType: !275, size: 6144, offset: 192)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 6144, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !258, file: !256, line: 163, baseType: !279, size: 6144, offset: 6336)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 6144, elements: !276)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !258, file: !256, line: 164, baseType: !279, size: 6144, offset: 12480)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !258, file: !256, line: 168, baseType: !282, size: 112, offset: 18624)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 112, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 14)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !258, file: !256, line: 174, baseType: !286, size: 96, offset: 18736)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 96, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 6)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !258, file: !256, line: 175, baseType: !290, size: 48, offset: 18832)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 48, elements: !287)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !258, file: !256, line: 178, baseType: !115, size: 8, offset: 18880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !258, file: !256, line: 179, baseType: !115, size: 8, offset: 18888)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !258, file: !256, line: 180, baseType: !294, size: 80, offset: 18896)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 80, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 10)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !258, file: !256, line: 183, baseType: !201, size: 64, offset: 19008)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !258, file: !256, line: 184, baseType: !201, size: 64, offset: 19072)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !258, file: !256, line: 185, baseType: !201, size: 64, offset: 19136)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !258, file: !256, line: 186, baseType: !201, size: 64, offset: 19200)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !258, file: !256, line: 188, baseType: !201, size: 64, offset: 19264)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !258, file: !256, line: 189, baseType: !203, size: 64, offset: 19328)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !258, file: !256, line: 190, baseType: !201, size: 64, offset: 19392)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !258, file: !256, line: 191, baseType: !201, size: 64, offset: 19456)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !258, file: !256, line: 197, baseType: !203, size: 64, offset: 19520)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !258, file: !256, line: 199, baseType: !201, size: 64, offset: 19584)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !258, file: !256, line: 200, baseType: !201, size: 64, offset: 19648)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !258, file: !256, line: 202, baseType: !309, size: 64, offset: 19712)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !272)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !258, file: !256, line: 205, baseType: !313, size: 32, offset: 19776)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !258, file: !256, line: 206, baseType: !313, size: 32, offset: 19808)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !258, file: !256, line: 207, baseType: !45, size: 32, offset: 19840)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !258, file: !256, line: 208, baseType: !45, size: 32, offset: 19872)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !258, file: !256, line: 213, baseType: !29, size: 64, offset: 19904)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !258, file: !256, line: 214, baseType: !29, size: 64, offset: 19968)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !258, file: !256, line: 215, baseType: !29, size: 64, offset: 20032)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !258, file: !256, line: 216, baseType: !29, size: 64, offset: 20096)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !258, file: !256, line: 217, baseType: !29, size: 64, offset: 20160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !258, file: !256, line: 218, baseType: !29, size: 64, offset: 20224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !258, file: !256, line: 219, baseType: !29, size: 64, offset: 20288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !258, file: !256, line: 220, baseType: !29, size: 64, offset: 20352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !258, file: !256, line: 221, baseType: !29, size: 64, offset: 20416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !258, file: !256, line: 222, baseType: !29, size: 64, offset: 20480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !258, file: !256, line: 223, baseType: !29, size: 64, offset: 20544)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !258, file: !256, line: 226, baseType: !29, size: 64, offset: 20608)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !258, file: !256, line: 227, baseType: !29, size: 64, offset: 20672)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !258, file: !256, line: 228, baseType: !29, size: 64, offset: 20736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !258, file: !256, line: 231, baseType: !29, size: 64, offset: 20800)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !258, file: !256, line: 232, baseType: !29, size: 64, offset: 20864)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !258, file: !256, line: 233, baseType: !29, size: 64, offset: 20928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !258, file: !256, line: 234, baseType: !29, size: 64, offset: 20992)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !258, file: !256, line: 235, baseType: !29, size: 64, offset: 21056)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !258, file: !256, line: 236, baseType: !29, size: 64, offset: 21120)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !258, file: !256, line: 237, baseType: !29, size: 64, offset: 21184)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !258, file: !256, line: 238, baseType: !29, size: 64, offset: 21248)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !258, file: !256, line: 239, baseType: !29, size: 64, offset: 21312)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !258, file: !256, line: 240, baseType: !29, size: 64, offset: 21376)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !258, file: !256, line: 241, baseType: !29, size: 64, offset: 21440)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !258, file: !256, line: 242, baseType: !29, size: 64, offset: 21504)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !258, file: !256, line: 243, baseType: !29, size: 64, offset: 21568)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !258, file: !256, line: 244, baseType: !29, size: 64, offset: 21632)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !258, file: !256, line: 245, baseType: !29, size: 64, offset: 21696)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !258, file: !256, line: 246, baseType: !29, size: 64, offset: 21760)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !258, file: !256, line: 247, baseType: !29, size: 64, offset: 21824)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !258, file: !256, line: 248, baseType: !29, size: 64, offset: 21888)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !258, file: !256, line: 249, baseType: !29, size: 64, offset: 21952)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !258, file: !256, line: 250, baseType: !29, size: 64, offset: 22016)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !258, file: !256, line: 251, baseType: !29, size: 64, offset: 22080)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !258, file: !256, line: 253, baseType: !29, size: 64, offset: 22144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !258, file: !256, line: 256, baseType: !29, size: 64, offset: 22208)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !258, file: !256, line: 257, baseType: !29, size: 64, offset: 22272)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !258, file: !256, line: 258, baseType: !29, size: 64, offset: 22336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !258, file: !256, line: 259, baseType: !29, size: 64, offset: 22400)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !258, file: !256, line: 260, baseType: !29, size: 64, offset: 22464)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !258, file: !256, line: 261, baseType: !29, size: 64, offset: 22528)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !258, file: !256, line: 262, baseType: !29, size: 64, offset: 22592)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !258, file: !256, line: 264, baseType: !29, size: 64, offset: 22656)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !258, file: !256, line: 265, baseType: !29, size: 64, offset: 22720)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !258, file: !256, line: 266, baseType: !29, size: 64, offset: 22784)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !258, file: !256, line: 267, baseType: !29, size: 64, offset: 22848)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !258, file: !256, line: 268, baseType: !29, size: 64, offset: 22912)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !258, file: !256, line: 269, baseType: !29, size: 64, offset: 22976)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !258, file: !256, line: 270, baseType: !29, size: 64, offset: 23040)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !258, file: !256, line: 272, baseType: !29, size: 64, offset: 23104)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !258, file: !256, line: 273, baseType: !29, size: 64, offset: 23168)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !258, file: !256, line: 274, baseType: !29, size: 64, offset: 23232)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !258, file: !256, line: 275, baseType: !29, size: 64, offset: 23296)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !258, file: !256, line: 276, baseType: !29, size: 64, offset: 23360)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !258, file: !256, line: 277, baseType: !29, size: 64, offset: 23424)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !258, file: !256, line: 278, baseType: !29, size: 64, offset: 23488)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !258, file: !256, line: 279, baseType: !29, size: 64, offset: 23552)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !258, file: !256, line: 280, baseType: !29, size: 64, offset: 23616)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !258, file: !256, line: 281, baseType: !29, size: 64, offset: 23680)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !258, file: !256, line: 282, baseType: !29, size: 64, offset: 23744)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !258, file: !256, line: 283, baseType: !29, size: 64, offset: 23808)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !258, file: !256, line: 285, baseType: !29, size: 64, offset: 23872)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !258, file: !256, line: 286, baseType: !29, size: 64, offset: 23936)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !258, file: !256, line: 287, baseType: !29, size: 64, offset: 24000)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !258, file: !256, line: 288, baseType: !29, size: 64, offset: 24064)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !258, file: !256, line: 289, baseType: !29, size: 64, offset: 24128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !258, file: !256, line: 290, baseType: !29, size: 64, offset: 24192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !258, file: !256, line: 291, baseType: !29, size: 64, offset: 24256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !258, file: !256, line: 292, baseType: !29, size: 64, offset: 24320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !258, file: !256, line: 293, baseType: !29, size: 64, offset: 24384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !258, file: !256, line: 294, baseType: !29, size: 64, offset: 24448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !258, file: !256, line: 295, baseType: !29, size: 64, offset: 24512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !258, file: !256, line: 296, baseType: !29, size: 64, offset: 24576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !258, file: !256, line: 298, baseType: !29, size: 64, offset: 24640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !258, file: !256, line: 299, baseType: !29, size: 64, offset: 24704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !258, file: !256, line: 301, baseType: !29, size: 64, offset: 24768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !258, file: !256, line: 302, baseType: !29, size: 64, offset: 24832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !258, file: !256, line: 303, baseType: !29, size: 64, offset: 24896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !258, file: !256, line: 304, baseType: !29, size: 64, offset: 24960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !258, file: !256, line: 305, baseType: !29, size: 64, offset: 25024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !258, file: !256, line: 307, baseType: !29, size: 64, offset: 25088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !258, file: !256, line: 308, baseType: !29, size: 64, offset: 25152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !258, file: !256, line: 309, baseType: !29, size: 64, offset: 25216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !258, file: !256, line: 310, baseType: !29, size: 64, offset: 25280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !258, file: !256, line: 311, baseType: !29, size: 64, offset: 25344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !258, file: !256, line: 316, baseType: !29, size: 64, offset: 25408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !258, file: !256, line: 317, baseType: !29, size: 64, offset: 25472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !258, file: !256, line: 318, baseType: !29, size: 64, offset: 25536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !258, file: !256, line: 319, baseType: !29, size: 64, offset: 25600)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !258, file: !256, line: 322, baseType: !408, size: 896, offset: 25664)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !256, line: 149, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 111, size: 896, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !436, !437}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !409, file: !256, line: 112, baseType: !205, size: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !409, file: !256, line: 113, baseType: !205, size: 16, offset: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !409, file: !256, line: 114, baseType: !205, size: 16, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !409, file: !256, line: 115, baseType: !205, size: 16, offset: 48)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !409, file: !256, line: 116, baseType: !205, size: 16, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !409, file: !256, line: 117, baseType: !205, size: 16, offset: 80)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !409, file: !256, line: 118, baseType: !205, size: 16, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !409, file: !256, line: 119, baseType: !205, size: 16, offset: 112)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !409, file: !256, line: 120, baseType: !205, size: 16, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !409, file: !256, line: 121, baseType: !205, size: 16, offset: 144)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !409, file: !256, line: 122, baseType: !205, size: 16, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !409, file: !256, line: 123, baseType: !205, size: 16, offset: 176)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !409, file: !256, line: 124, baseType: !205, size: 16, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !409, file: !256, line: 125, baseType: !205, size: 16, offset: 208)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !409, file: !256, line: 127, baseType: !205, size: 16, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !409, file: !256, line: 128, baseType: !205, size: 16, offset: 240)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !409, file: !256, line: 130, baseType: !203, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !409, file: !256, line: 131, baseType: !203, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !409, file: !256, line: 132, baseType: !203, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !409, file: !256, line: 135, baseType: !203, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !409, file: !256, line: 138, baseType: !203, size: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !409, file: !256, line: 141, baseType: !203, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !409, file: !256, line: 142, baseType: !203, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !409, file: !256, line: 145, baseType: !435, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !409, file: !256, line: 146, baseType: !435, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !409, file: !256, line: 148, baseType: !205, size: 16, offset: 832)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !197, file: !210, line: 380, type: !255, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "utf8", scope: !197, file: !210, line: 387, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !287)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "ascii", scope: !197, file: !210, line: 388, type: !442, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "__code2flag", scope: !197, file: !210, line: 854, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 256, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 16)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !256, line: 324, baseType: !258)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !453, file: !454, line: 131, type: !498, isLocal: true, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !455, nameTableKind: None)
!454 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-90")
!455 = !{!456, !488, !490, !492, !494, !496, !451}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "stdin", scope: !453, file: !454, line: 154, type: !458, isLocal: false, isDefinition: true)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !460, line: 46, baseType: !461)
!460 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-90")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !462, line: 233, size: 704, elements: !463)
!462 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-90")
!463 = !{!464, !465, !469, !470, !471, !472, !473, !474, !475, !476, !478, !480, !487}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !461, file: !462, line: 234, baseType: !113, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !461, file: !462, line: 237, baseType: !466, size: 16, offset: 16)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 16, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !461, file: !462, line: 244, baseType: !45, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !461, file: !462, line: 246, baseType: !207, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !461, file: !462, line: 247, baseType: !207, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !461, file: !462, line: 248, baseType: !207, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !461, file: !462, line: 249, baseType: !207, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !461, file: !462, line: 252, baseType: !207, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !461, file: !462, line: 255, baseType: !207, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !461, file: !462, line: 261, baseType: !477, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !461, file: !462, line: 268, baseType: !479, size: 64, offset: 512)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 64, elements: !467)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !461, file: !462, line: 271, baseType: !481, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !482, line: 85, baseType: !483)
!482 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-90")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 81, size: 64, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !483, file: !482, line: 83, baseType: !313, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !483, file: !482, line: 84, baseType: !313, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !461, file: !462, line: 274, baseType: !6, size: 64, offset: 640)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "stdout", scope: !453, file: !454, line: 155, type: !458, isLocal: false, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "stderr", scope: !453, file: !454, line: 156, type: !458, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "__stdin", scope: !453, file: !454, line: 159, type: !458, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__stdout", scope: !453, file: !454, line: 162, type: !458, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !453, file: !454, line: 180, type: !458, isLocal: false, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 2112, elements: !157)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !501, file: !504, line: 309, type: !505, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !503, nameTableKind: None)
!502 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/tmp/klee-uclibc-90")
!503 = !{!499}
!504 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/tmp/klee-uclibc-90")
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !45}
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "program_name", scope: !510, file: !511, line: 39, type: !7, isLocal: false, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !512, retainedTypes: !533, globals: !536, nameTableKind: None)
!511 = !DIFile(filename: "../../src/mkdir.c", directory: "/coreutils-6.10/obj-llvm/src")
!512 = !{!513}
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !515, file: !514, line: 31, baseType: !132, size: 32, elements: !526)
!514 = !DIFile(filename: "../../lib/savewd.h", directory: "/coreutils-6.10/obj-llvm/src")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !514, line: 28, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !515, file: !514, line: 58, baseType: !513, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !515, file: !514, line: 66, baseType: !519, size: 32, offset: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !514, line: 61, size: 32, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !519, file: !514, line: 63, baseType: !45, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !519, file: !514, line: 64, baseType: !45, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !519, file: !514, line: 65, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !102, line: 98, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !104, line: 142, baseType: !45)
!526 = !{!527, !528, !529, !530, !531, !532}
!527 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!528 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!529 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!530 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!531 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!532 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!533 = !{!29, !7, !6, !534, !535}
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !102, line: 80, baseType: !134)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !102, line: 65, baseType: !136)
!536 = !{!508, !537}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "longopts", scope: !510, file: !511, line: 41, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 1792, elements: !549)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !542, line: 50, size: 256, elements: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!543 = !{!544, !545, !546, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !541, file: !542, line: 52, baseType: !29, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !541, file: !542, line: 55, baseType: !45, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !542, line: 56, baseType: !547, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !541, file: !542, line: 57, baseType: !45, size: 32, offset: 192)
!549 = !{!550}
!550 = !DISubrange(count: 7)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !553, file: !554, line: 26, type: !556, isLocal: false, isDefinition: true)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !555, nameTableKind: None)
!554 = !DIFile(filename: "../../lib/version-etc-fsf.c", directory: "/coreutils-6.10/obj-llvm/lib")
!555 = !{!551}
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 47)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "exit_failure", scope: !561, file: !562, line: 24, type: !564, isLocal: false, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !563, nameTableKind: None)
!562 = !DIFile(filename: "../../lib/exitfail.c", directory: "/coreutils-6.10/obj-llvm/lib")
!563 = !{!559}
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "slot0", scope: !567, file: !568, line: 555, type: !117, isLocal: true, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !569, retainedTypes: !580, globals: !581, nameTableKind: None)
!568 = !DIFile(filename: "../../lib/quotearg.c", directory: "/coreutils-6.10/obj-llvm/lib")
!569 = !{!570}
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !571, line: 27, baseType: !132, size: 32, elements: !572)
!571 = !DIFile(filename: "../../lib/quotearg.h", directory: "/coreutils-6.10/obj-llvm/lib")
!572 = !{!573, !574, !575, !576, !577, !578, !579}
!573 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!574 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!575 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!576 = !DIEnumerator(name: "c_quoting_style", value: 3, isUnsigned: true)
!577 = !DIEnumerator(name: "escape_quoting_style", value: 4, isUnsigned: true)
!578 = !DIEnumerator(name: "locale_quoting_style", value: 5, isUnsigned: true)
!579 = !DIEnumerator(name: "clocale_quoting_style", value: 6, isUnsigned: true)
!580 = !{!23, !45, !113, !29, !7}
!581 = !{!582, !588, !592, !565, !599, !606, !608}
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !567, file: !568, line: 74, type: !584, isLocal: false, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 512, elements: !586)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!586 = !{!587}
!587 = !DISubrange(count: 8)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !567, file: !568, line: 87, type: !590, isLocal: false, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 224, elements: !549)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !567, file: !568, line: 99, type: !594, isLocal: true, isDefinition: true)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !568, line: 63, size: 288, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !594, file: !568, line: 66, baseType: !570, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !594, file: !568, line: 70, baseType: !598, size: 256, offset: 32)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 256, elements: !586)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "slotvec", scope: !567, file: !568, line: 558, type: !601, isLocal: true, isDefinition: true)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !568, line: 547, size: 128, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !568, line: 549, baseType: !23, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !602, file: !568, line: 550, baseType: !7, size: 64, offset: 64)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "nslots", scope: !567, file: !568, line: 556, type: !132, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "slotvec0", scope: !567, file: !568, line: 557, type: !602, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !612, file: !613, line: 114, type: !708, isLocal: true, isDefinition: true)
!612 = distinct !DISubprogram(name: "printf_fetchargs", scope: !613, file: !613, line: 38, type: !614, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !703)
!613 = !DIFile(filename: "../../lib/printf-args.c", directory: "/coreutils-6.10/obj-llvm/lib")
!614 = !DISubroutineType(types: !615)
!615 = !{!45, !616, !623}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !613, size: 192, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !617, file: !613, baseType: !132, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !617, file: !613, baseType: !132, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !617, file: !613, baseType: !6, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !617, file: !613, baseType: !6, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !625, line: 145, baseType: !626)
!625 = !DIFile(filename: "../../lib/printf-args.h", directory: "/coreutils-6.10/obj-llvm/lib")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 140, size: 128, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !626, file: !625, line: 142, baseType: !23, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !626, file: !625, line: 143, baseType: !630, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !625, line: 138, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 93, size: 256, elements: !633)
!633 = !{!634, !661}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !625, line: 95, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !625, line: 90, baseType: !636)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 51, baseType: !132, size: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!638 = !DIEnumerator(name: "TYPE_NONE", value: 0, isUnsigned: true)
!639 = !DIEnumerator(name: "TYPE_SCHAR", value: 1, isUnsigned: true)
!640 = !DIEnumerator(name: "TYPE_UCHAR", value: 2, isUnsigned: true)
!641 = !DIEnumerator(name: "TYPE_SHORT", value: 3, isUnsigned: true)
!642 = !DIEnumerator(name: "TYPE_USHORT", value: 4, isUnsigned: true)
!643 = !DIEnumerator(name: "TYPE_INT", value: 5, isUnsigned: true)
!644 = !DIEnumerator(name: "TYPE_UINT", value: 6, isUnsigned: true)
!645 = !DIEnumerator(name: "TYPE_LONGINT", value: 7, isUnsigned: true)
!646 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8, isUnsigned: true)
!647 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9, isUnsigned: true)
!648 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10, isUnsigned: true)
!649 = !DIEnumerator(name: "TYPE_DOUBLE", value: 11, isUnsigned: true)
!650 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 12, isUnsigned: true)
!651 = !DIEnumerator(name: "TYPE_CHAR", value: 13, isUnsigned: true)
!652 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 14, isUnsigned: true)
!653 = !DIEnumerator(name: "TYPE_STRING", value: 15, isUnsigned: true)
!654 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 16, isUnsigned: true)
!655 = !DIEnumerator(name: "TYPE_POINTER", value: 17, isUnsigned: true)
!656 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 18, isUnsigned: true)
!657 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 19, isUnsigned: true)
!658 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 20, isUnsigned: true)
!659 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 21, isUnsigned: true)
!660 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 22, isUnsigned: true)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !632, file: !625, line: 136, baseType: !662, size: 128, offset: 128)
!662 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !625, line: 96, size: 128, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675, !677, !679, !681, !682, !685, !686, !689, !690, !692, !694, !695, !697}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !662, file: !625, line: 98, baseType: !206, size: 8)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !662, file: !625, line: 99, baseType: !115, size: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !662, file: !625, line: 100, baseType: !272, size: 16)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !662, file: !625, line: 101, baseType: !113, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !662, file: !625, line: 102, baseType: !45, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !662, file: !625, line: 103, baseType: !132, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !662, file: !625, line: 104, baseType: !100, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !662, file: !625, line: 105, baseType: !10, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !662, file: !625, line: 107, baseType: !673, size: 64)
!673 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !662, file: !625, line: 108, baseType: !25, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !662, file: !625, line: 110, baseType: !676, size: 32)
!676 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !662, file: !625, line: 111, baseType: !678, size: 64)
!678 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !662, file: !625, line: 112, baseType: !680, size: 128)
!680 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !662, file: !625, line: 113, baseType: !45, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !662, file: !625, line: 115, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !684, line: 20, baseType: !132)
!684 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !662, file: !625, line: 117, baseType: !29, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !662, file: !625, line: 119, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !662, file: !625, line: 121, baseType: !6, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !662, file: !625, line: 122, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !662, file: !625, line: 123, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !662, file: !625, line: 124, baseType: !547, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !662, file: !625, line: 125, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !662, file: !625, line: 127, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !700, retainedTypes: !701, globals: !702, nameTableKind: None)
!700 = !{!636}
!701 = !{!6}
!702 = !{!610}
!703 = !{!704, !705, !706, !707}
!704 = !DILocalVariable(name: "args", arg: 1, scope: !612, file: !613, line: 38, type: !616)
!705 = !DILocalVariable(name: "a", arg: 2, scope: !612, file: !613, line: 38, type: !623)
!706 = !DILocalVariable(name: "i", scope: !612, file: !613, line: 40, type: !23)
!707 = !DILocalVariable(name: "ap", scope: !612, file: !613, line: 41, type: !630)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 224, elements: !549)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__exe_env", scope: !711, file: !716, line: 34, type: !764, isLocal: false, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C89, file: !712, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !713, nameTableKind: None)
!712 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd_init.c", directory: "/tmp/klee_build90stp_z3/runtime/POSIX")
!713 = !{!709, !714}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !711, file: !716, line: 21, type: !717, isLocal: false, isDefinition: true)
!716 = !DIFile(filename: "klee_src/runtime/POSIX/fd_init.c", directory: "/tmp")
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !718, line: 74, baseType: !719)
!718 = !DIFile(filename: "klee_src/runtime/POSIX/fd.h", directory: "/tmp")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 62, size: 832, elements: !720)
!720 = !{!721, !722, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !719, file: !718, line: 63, baseType: !132, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !719, file: !718, line: 64, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !718, line: 44, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 40, size: 192, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !718, line: 41, baseType: !132, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !725, file: !718, line: 42, baseType: !7, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !725, file: !718, line: 43, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !122, line: 119, size: 1152, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !745, !750, !751, !752}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !731, file: !122, line: 121, baseType: !125, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !731, file: !122, line: 123, baseType: !110, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !731, file: !122, line: 124, baseType: !129, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !731, file: !122, line: 125, baseType: !131, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !731, file: !122, line: 132, baseType: !134, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !731, file: !122, line: 133, baseType: !136, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !731, file: !122, line: 135, baseType: !45, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !731, file: !122, line: 136, baseType: !125, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !731, file: !122, line: 137, baseType: !140, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !731, file: !122, line: 143, baseType: !142, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !731, file: !122, line: 144, baseType: !744, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !104, line: 168, baseType: !100)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !731, file: !122, line: 152, baseType: !746, size: 128, offset: 576)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !147, line: 9, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !746, file: !147, line: 11, baseType: !150, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !746, file: !147, line: 12, baseType: !152, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !731, file: !122, line: 153, baseType: !746, size: 128, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !731, file: !122, line: 154, baseType: !746, size: 128, offset: 832)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !731, file: !122, line: 164, baseType: !156, size: 192, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !719, file: !718, line: 64, baseType: !723, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !719, file: !718, line: 65, baseType: !132, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !719, file: !718, line: 66, baseType: !723, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !719, file: !718, line: 69, baseType: !132, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !719, file: !718, line: 72, baseType: !547, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !719, file: !718, line: 72, baseType: !547, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !719, file: !718, line: 72, baseType: !547, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !719, file: !718, line: 72, baseType: !547, size: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !719, file: !718, line: 72, baseType: !547, size: 64, offset: 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !719, file: !718, line: 73, baseType: !547, size: 64, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !719, file: !718, line: 73, baseType: !547, size: 64, offset: 768)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !718, line: 89, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 81, size: 6272, elements: !766)
!766 = !{!767, !778, !779, !780}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !765, file: !718, line: 82, baseType: !768, size: 6144)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 6144, elements: !776)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !718, line: 60, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 53, size: 192, elements: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !770, file: !718, line: 54, baseType: !45, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !718, line: 55, baseType: !132, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !770, file: !718, line: 58, baseType: !101, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !770, file: !718, line: 59, baseType: !723, size: 64, offset: 128)
!776 = !{!777}
!777 = !DISubrange(count: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !765, file: !718, line: 83, baseType: !184, size: 32, offset: 6144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !765, file: !718, line: 84, baseType: !132, size: 32, offset: 6176)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !765, file: !718, line: 88, baseType: !45, size: 32, offset: 6208)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !783, file: !788, line: 11, type: !790, isLocal: true, isDefinition: true)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !785, nameTableKind: None)
!784 = !DIFile(filename: "./extra/locale/locale_data.c", directory: "/tmp/klee-uclibc-90")
!785 = !{!786, !781}
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !783, file: !788, line: 20149, type: !789, isLocal: false, isDefinition: true)
!788 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/tmp/klee-uclibc-90")
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !792, line: 91, baseType: !793)
!792 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/tmp/klee-uclibc-90")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !792, line: 31, size: 2047232, elements: !794)
!794 = !{!795, !799, !803, !807, !811, !815, !819, !823, !827, !831, !835, !839, !843, !860, !862, !864, !866, !870, !872, !876, !880, !884, !888, !892, !896, !900, !904, !908, !912, !916, !917, !921, !925, !929, !933, !937}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !793, file: !792, line: 37, baseType: !796, size: 3360)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 3360, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 420)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !793, file: !792, line: 38, baseType: !800, size: 4032, offset: 3360)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 4032, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 504)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !793, file: !792, line: 40, baseType: !804, size: 28160, offset: 7392)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 28160, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 1760)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !793, file: !792, line: 41, baseType: !808, size: 36224, offset: 35552)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 36224, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 4528)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !793, file: !792, line: 46, baseType: !812, size: 28832, offset: 71776)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 28832, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 3604)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !793, file: !792, line: 47, baseType: !816, size: 13440, offset: 100608)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 13440, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 1680)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !793, file: !792, line: 48, baseType: !820, size: 3136, offset: 114048)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 3136, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 196)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !793, file: !792, line: 53, baseType: !824, size: 408, offset: 117184)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 408, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 51)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !793, file: !792, line: 54, baseType: !828, size: 224, offset: 117592)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 224, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 28)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !793, file: !792, line: 55, baseType: !832, size: 13168, offset: 117816)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 13168, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 1646)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !793, file: !792, line: 56, baseType: !836, size: 226824, offset: 130984)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 226824, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 28353)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !793, file: !792, line: 58, baseType: !840, size: 14432, offset: 357808)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 14432, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 1804)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !793, file: !792, line: 62, baseType: !844, size: 15824, offset: 372240)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 15824, elements: !858)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !847, line: 21, baseType: !848)
!847 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/tmp/klee-uclibc-90")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !847, line: 16, size: 688, elements: !849)
!849 = !{!850, !852, !853, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !848, file: !847, line: 17, baseType: !851, size: 128)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !848, file: !847, line: 18, baseType: !851, size: 128, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !848, file: !847, line: 19, baseType: !851, size: 128, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !848, file: !847, line: 20, baseType: !855, size: 304, offset: 384)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 304, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 38)
!858 = !{!859}
!859 = !DISubrange(count: 23)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !793, file: !792, line: 65, baseType: !861, size: 160, offset: 388064)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 160, elements: !81)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !793, file: !792, line: 65, baseType: !863, size: 160, offset: 388224)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 160, elements: !295)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !793, file: !792, line: 65, baseType: !865, size: 320, offset: 388384)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !81)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !793, file: !792, line: 66, baseType: !867, size: 360, offset: 388704)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 360, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 45)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !793, file: !792, line: 66, baseType: !871, size: 48, offset: 389072)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 48, elements: !157)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !793, file: !792, line: 66, baseType: !873, size: 240, offset: 389120)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 240, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 15)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !793, file: !792, line: 67, baseType: !877, size: 31152, offset: 389360)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 31152, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 3894)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !793, file: !792, line: 67, baseType: !881, size: 352, offset: 420512)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 352, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 22)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !793, file: !792, line: 67, baseType: !885, size: 6512, offset: 420864)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 6512, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 407)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !793, file: !792, line: 68, baseType: !889, size: 66000, offset: 427376)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 66000, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 8250)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !793, file: !792, line: 68, baseType: !893, size: 800, offset: 493376)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 800, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 50)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !793, file: !792, line: 68, baseType: !897, size: 54864, offset: 494176)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 54864, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 3429)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !793, file: !792, line: 70, baseType: !901, size: 2976, offset: 549040)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2976, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 372)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !793, file: !792, line: 70, baseType: !905, size: 64, offset: 552016)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 4)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !793, file: !792, line: 70, baseType: !909, size: 3200, offset: 552080)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 3200, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 200)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !793, file: !792, line: 72, baseType: !913, size: 1458256, offset: 555280)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1458256, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 91141)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !793, file: !792, line: 74, baseType: !290, size: 48, offset: 2013536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !793, file: !792, line: 75, baseType: !918, size: 1536, offset: 2013632)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 24)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !793, file: !792, line: 80, baseType: !922, size: 22608, offset: 2015168)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 22608, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 2826)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !793, file: !792, line: 81, baseType: !926, size: 6680, offset: 2037776)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 6680, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 835)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !793, file: !792, line: 82, baseType: !930, size: 144, offset: 2044456)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 144, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 18)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !793, file: !792, line: 85, baseType: !934, size: 552, offset: 2044600)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 552, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 69)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !793, file: !792, line: 87, baseType: !938, size: 2040, offset: 2045152)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2040, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 255)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !943, file: !948, line: 471, type: !949, isLocal: false, isDefinition: true)
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !945, nameTableKind: None)
!944 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/tmp/klee-uclibc-90")
!945 = !{!941, !946}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !943, file: !948, line: 862, type: !261, isLocal: false, isDefinition: true)
!948 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/tmp/klee-uclibc-90")
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 6144, elements: !276)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !952, file: !948, line: 878, type: !957, isLocal: false, isDefinition: true)
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !954, nameTableKind: None)
!953 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/tmp/klee-uclibc-90")
!954 = !{!950, !955}
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !952, file: !948, line: 981, type: !268, isLocal: false, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 6144, elements: !276)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !960, file: !948, line: 1000, type: !957, isLocal: false, isDefinition: true)
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !962, nameTableKind: None)
!961 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/tmp/klee-uclibc-90")
!962 = !{!958, !963}
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !960, file: !948, line: 1103, type: !268, isLocal: false, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "errno", scope: !967, file: !968, line: 7, type: !45, isLocal: false, isDefinition: true)
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !969, nameTableKind: None)
